apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_twai.c
/****************************************************************************
 * arch/risc-v/src/esp32c3-legacy/esp32c3_twai.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/can/can.h>
#include <nuttx/signal.h>

#include "riscv_internal.h"

#include "esp32c3_gpio.h"
#include "esp32c3_twai.h"
#include "esp32c3_irq.h"
#include "esp32c3_clockconfig.h"

#include "hardware/esp32c3_system.h"
#include "hardware/esp32c3_gpio_sigmap.h"

#if defined(CONFIG_ESP32C3_TWAI)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* Default values written to various registers on initialization */
#define TWAI_INIT_TEC             0
#define TWAI_INIT_REC             0
#define TWAI_INIT_EWL             96

#define TWAI_DEFAULT_INTERRUPTS   0xe7  /* Exclude data overrun (bit[3]) and brp_div (bit[4]) */

#define TWAI_ACCEPTANCE_CODE      0x0           /* 32-bit address to match */
#define TWAI_ACCEPTANCE_MASK      0xffffffff    /* 32-bit address mask */

#ifdef CONFIG_ESP32C3_TWAI0

/* A TWAI bit rate must be provided */

#  ifndef CONFIG_ESP32C3_TWAI0_BITRATE
#    error "CONFIG_ESP32C3_TWAI0_BITRATE is not defined"
#  endif

/* If no sample point is provided, use a sample point of 80 */

#  ifndef CONFIG_ESP32C3_TWAI0_SAMPLEP
#    define CONFIG_ESP32C3_TWAI0_SAMPLEP 80
#  endif
#endif

/* If no Synchronization Jump Width is provided, use a SJW of 3 */

#ifndef CONFIG_ESP32C3_TWAI0_SJW
#  define CONFIG_ESP32C3_TWAI0_SJW 3
#endif

/* Debug ********************************************************************/

/* Non-standard debug that may be enabled just for testing TWAI */

#ifndef CONFIG_DEBUG_CAN_INFO
#  undef CONFIG_ESP32C3_TWAI_REGDEBUG
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* CAN hardware-dependent bit-timing constant
 * Used for calculating and checking bit-timing parameters
 */

struct can_bittiming_const
{
  uint32_t tseg1_min;  /* Time segment 1 */
  uint32_t tseg1_max;
  uint32_t tseg2_min;  /* Time segment 2 */
  uint32_t tseg2_max;
  uint32_t sjw_min;    /* Synchronization jump width */
  uint32_t sjw_max;
  uint32_t brp_min;    /* Bit-rate prescaler */
  uint32_t brp_max;
  uint32_t brp_inc;
};

struct twai_dev_s
{
  /* Device configuration */

  const struct can_bittiming_const *bittiming_const;
  uint8_t port;       /* TWAI port number */
  uint8_t periph;     /* Peripheral ID */
  uint8_t irq;        /* IRQ associated with this TWAI */
  int8_t cpuint;      /* CPU interrupt assigned to this TWAI */
  uint32_t bitrate;   /* Configured bit rate */
  uint32_t samplep;   /* Configured sample point */
  uint32_t sjw;       /* Synchronization jump width */
  uint32_t base;      /* TWAI register base address */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* TWAI Register access */

#ifdef CONFIG_ESP32C3_TWAI_REGDEBUG
static void twai_printreg(uint32_t addr, uint32_t value);
#endif

static uint32_t twai_getreg(uint32_t addr);
static void twai_putreg(uint32_t addr, uint32_t value);

/* TWAI methods */

static void esp32c3twai_reset(struct can_dev_s *dev);
static int  esp32c3twai_setup(struct can_dev_s *dev);
static void esp32c3twai_shutdown(struct can_dev_s *dev);
static void esp32c3twai_rxint(struct can_dev_s *dev, bool enable);
static void esp32c3twai_txint(struct can_dev_s *dev, bool enable);
static int  esp32c3twai_ioctl(struct can_dev_s *dev, int cmd,
                              unsigned long arg);
static int  esp32c3twai_remoterequest(struct can_dev_s *dev,
                                      uint16_t id);
static int  esp32c3twai_send(struct can_dev_s *dev,
                             struct can_msg_s *msg);
static bool esp32c3twai_txready(struct can_dev_s *dev);
static bool esp32c3twai_txempty(struct can_dev_s *dev);

/* TWAI interrupts */

static int esp32c3twai_interrupt(int irq, void *context, void *arg);

/* TWAI acceptance filter */

static void esp32c3twai_set_acc_filter(uint32_t code, uint32_t mask,
                                       bool single_filter);

/* TWAI bit-timing initialization */

static int twai_baud_rate(struct twai_dev_s *priv, int rate, int clock,
                          int sjw, int sampl_pt, int flags);

/****************************************************************************
 * Private Data
 ****************************************************************************/

