apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_twai.c
static const struct can_bittiming_const esp32c3_twai_bittiming_const =
{
  .tseg1_min        = 1,
  .tseg1_max        = 16,
  .tseg2_min        = 1,
  .tseg2_max        = 8,
  .sjw_min          = 1,
  .sjw_max          = 3,
  .brp_min          = 1,
  .brp_max          = 64,
  .brp_inc          = 1,
};

static const struct can_ops_s g_twaiops =
{
  .co_reset         = esp32c3twai_reset,
  .co_setup         = esp32c3twai_setup,
  .co_shutdown      = esp32c3twai_shutdown,
  .co_rxint         = esp32c3twai_rxint,
  .co_txint         = esp32c3twai_txint,
  .co_ioctl         = esp32c3twai_ioctl,
  .co_remoterequest = esp32c3twai_remoterequest,
  .co_send          = esp32c3twai_send,
  .co_txready       = esp32c3twai_txready,
  .co_txempty       = esp32c3twai_txempty,
};

#ifdef CONFIG_ESP32C3_TWAI0
static struct twai_dev_s g_twai0priv =
{
  .bittiming_const  = &esp32c3_twai_bittiming_const,
  .port             = 0,
  .periph           = ESP32C3_PERIPH_TWAI,
  .irq              = ESP32C3_IRQ_TWAI,
  .cpuint           = -ENOMEM,
  .bitrate          = CONFIG_ESP32C3_TWAI0_BITRATE,
  .samplep          = CONFIG_ESP32C3_TWAI0_SAMPLEP,
  .sjw              = CONFIG_ESP32C3_TWAI0_SJW,
  .base             = DR_REG_TWAI_BASE,
};

static struct can_dev_s g_twai0dev =
{
  .cd_ops           = &g_twaiops,
  .cd_priv          = &g_twai0priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: twai_printreg
 *
 * Description:
 *   Print the value read from a register.
 *
 * Input Parameters:
 *   addr - The register address
 *   value - The register value
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32C3_TWAI_REGDEBUG
static void twai_printreg(uint32_t addr, uint32_t value)
{
  static uint32_t prevaddr;
  static uint32_t preval;
  static uint32_t count;

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && value == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              caninfo("...\n");
            }

          return;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          caninfo("[repeats %d more times]\n", count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = value;
      count    = 1;
    }

  /* Show the register value read */

  caninfo("%08" PRIx32 "<-%08" PRIx32 "\n", addr, value);
}
#endif

/****************************************************************************
 * Name: twai_getreg
 *
 * Description:
 *   Read the value of an TWAI register.
 *
 * Input Parameters:
 *   addr - The address to the register to read
 *
 * Returned Value:
 *
 ****************************************************************************/

static uint32_t twai_getreg(uint32_t addr)
{
  uint32_t value;

  /* Read the value from the register */

  value = getreg32(addr);
#ifdef CONFIG_ESP32C3_TWAI_REGDEBUG
  twai_printreg(addr, value);
#endif
  return value;
}

/****************************************************************************
 * Name: twai_putreg
 *
 * Description:
 *   Set the value of an TWAI register.
 *
 * Input Parameters:
 *   addr - The address to the register to write
 *   value - The value to write to the register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void twai_putreg(uint32_t addr, uint32_t value)
{
#ifdef CONFIG_ESP32C3_TWAI_REGDEBUG
  /* Show the register value being written */

  caninfo("%08" PRIx32 "<-%08" PRIx32 "\n", addr, value);
#endif

  /* Write the value */

  putreg32(value, addr);
}

/****************************************************************************
 * Name: esp32c3twai_reset
 *
 * Description:
 *   Reset the TWAI device.  Called early to initialize the hardware. This
 *   function is called, before esp32_twai_setup() and on error conditions.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" CAN driver state structure.
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void esp32c3twai_reset(struct can_dev_s *dev)
{
  struct twai_dev_s *priv = (struct twai_dev_s *)dev->cd_priv;
  irqstate_t flags;
  int ret;

  caninfo("TWAI%" PRIu8 "\n", priv->port);

  flags = enter_critical_section();

  /* Disable the TWAI and stop ongoing transmissions */

  uint32_t mode_value = TWAI_RESET_MODE_M | TWAI_LISTEN_ONLY_MODE_M;
  twai_putreg(TWAI_MODE_REG, mode_value);                 /* Enter Reset Mode */

  twai_putreg(TWAI_INT_ENA_REG, 0);                       /* Disable interrupts */
  twai_getreg(TWAI_STATUS_REG);                           /* Clear status bits */

  twai_putreg(TWAI_TX_ERR_CNT_REG, TWAI_INIT_TEC);        /* TEC */
  twai_putreg(TWAI_RX_ERR_CNT_REG, TWAI_INIT_REC);        /* REC */
  twai_putreg(TWAI_ERR_WARNING_LIMIT_REG, TWAI_INIT_EWL); /* EWL */

  esp32c3twai_set_acc_filter(TWAI_ACCEPTANCE_CODE,
                             TWAI_ACCEPTANCE_MASK, true);

  /* Set bit timing */

  ret = twai_baud_rate(priv, priv->bitrate, esp32c3_clk_apb_freq(),
                       priv->sjw, priv->samplep, 0);

  if (ret != OK)
    {
      canerr("ERROR: Failed to set bit timing: %d\n", ret);
    }

  /* Restart the TWAI */

#ifdef CONFIG_CAN_LOOPBACK
  twai_putreg(TWAI_MODE_REG, TWAI_SELF_TEST_MODE_M); /* Leave Reset Mode, enter Test Mode */
#else
  twai_putreg(TWAI_MODE_REG, 0);                     /* Leave Reset Mode */
#endif

