apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_twai.c
  /* tseg even = round down, odd = round up */

  for (tseg = (0 + 0 + 2) * 2;
       tseg <= (timing->tseg2_max + timing->tseg1_max + 2) * 2 + 1; tseg++)
    {
      brp = clock / ((1 + tseg / 2) * rate) + tseg % 2;
      if (brp == 0 || brp > 64)
        {
          continue;
        }

      error = rate - clock / (brp * (1 + tseg / 2));
      if (error < 0)
        {
          error = -error;
        }

      if (error <= best_error)
        {
          best_error = error;
          best_tseg = tseg / 2;
          best_brp = brp;
          best_rate = clock / (brp * (1 + tseg / 2));
        }
    }

  if (best_error && (rate / best_error < 10))
    {
      caninfo("baud rate %d is not possible with %d Hz clock\n",
              rate, clock);
      caninfo("%d bps. brp=%d, best_tseg=%d, tseg1=%d, tseg2=%d\n",
              best_rate, best_brp, best_tseg, tseg1, tseg2);
      return -EINVAL;
    }

  tseg2 = best_tseg - (sampl_pt * (best_tseg + 1)) / 100 + 1;
  if (tseg2 < 0)
    {
      tseg2 = 0;
    }

  if (tseg2 > timing->tseg2_max)
    {
      tseg2 = timing->tseg2_max;
    }

  tseg1 = best_tseg - tseg2;
  if (tseg1 > timing->tseg1_max)
    {
      tseg1 = timing->tseg1_max;
      tseg2 = best_tseg - tseg1;
    }

  caninfo("TS1: %d TS2: %d BRP: %d\n", tseg1, tseg2, best_brp);

  /* Configure bit timing */

    timing0 = (best_brp - 1) / 2;
    timing0 |= (sjw - 1) << TWAI_SYNC_JUMP_WIDTH_S;

    timing1 = tseg1 - 1;
    timing1 |= (tseg2 - 1) << TWAI_TIME_SEG2_S;

  #ifdef CONFIG_ESP32C3_TWAI0_SAM
  /* The bus is sampled 3 times (recommended for low to medium speed buses
   * to spikes on the bus-line).
   */

      timing1 |= CONFIG_ESP32C3_TWAI0_SAM << TWAI_TIME_SAMP_S;
  #endif

    twai_putreg(TWAI_BUS_TIMING_0_REG, timing0);
    twai_putreg(TWAI_BUS_TIMING_1_REG, timing1);

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_twaiinitialize
 *
 * Description:
 *   Initialize the selected TWAI port
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple TWAI interfaces)
 *
 * Returned Value:
 *   Valid TWAI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct can_dev_s *esp32c3_twaiinitialize(int port)
{
  struct can_dev_s *twaidev;
  irqstate_t flags;

  caninfo("TWAI%" PRIu8 "\n",  port);

  flags = enter_critical_section();

#ifdef CONFIG_ESP32C3_TWAI0
  if (port == 0)
    {
      /* Enable power to the TWAI module and
       * Enable clocking to the TWAI module
       */

      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, SYSTEM_TWAI_RST_M);
      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, SYSTEM_TWAI_CLK_EN_M, 0);

      nxsched_usleep(1);

      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, SYSTEM_TWAI_CLK_EN_M);
      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, SYSTEM_TWAI_RST_M, 0);

      /* Configure CAN GPIO pins */

      esp32c3_gpio_matrix_out(CONFIG_ESP32C3_TWAI0_TXPIN, TWAI_TX_IDX, 0, 0);
      esp32c3_configgpio(CONFIG_ESP32C3_TWAI0_TXPIN, OUTPUT_FUNCTION_1);

      esp32c3_configgpio(CONFIG_ESP32C3_TWAI0_RXPIN, INPUT_FUNCTION_1);
      esp32c3_gpio_matrix_in(CONFIG_ESP32C3_TWAI0_RXPIN, TWAI_RX_IDX, 0);

      twaidev = &g_twai0dev;
    }
  else
#endif

    {
      canerr("ERROR: Unsupported port: %d\n", port);
      leave_critical_section(flags);
      return NULL;
    }

  /* Then just perform a TWAI reset operation */

  esp32c3twai_reset(twaidev);

  leave_critical_section(flags);

  return twaidev;
}
#endif
